Revit 2027 API
ParameterTypeId.BendingDetailTypeAngularDimensionsEnabled Property
 "Angular Dimensions"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeAngularDimensionsEnabled { get; }
Public Shared ReadOnly Property BendingDetailTypeAngularDimensionsEnabled As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeAngularDimensionsEnabled {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeAngularDimensionsEnabled : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace